#Вывод даты
data = input("Введите дату вашего рождени: ")
print(f"Дата вашего рождения: {data}")
print()
#Вывод  результата и примера
a = -365 * 20
print("Выражение -365 * 20","Результат",a)
b = 0.5 * 650 - 25
print("Выражение 0.5 * 650 - 25","Результат",round(b))
c = (132 // 2 + 1) * 6
print("Выражение (132 // 2 + 1) * 6","Результат",c)
d = -576 + (23 * 45 - 13)
print("Выражение -576 + (23 * 45 - 13)","Результат",d)

# Вывод имени знаками
name = """
    * * *    *   *  00000
    *   *    *****  0
    * ***        *  0
    *            *  0
    *          ***  00000
"""

print(name)

# Вывод дома
home = """
.
┈╱╲╱╲╱╲╭╮╱╲╱╲╱╲┈
╱▔▔╲╱▔▔╲╱▔▔╲▂╱▔╲
▉▇▇▉◤▔▔▔▔̴▔▔▔◢▇▉▇
▉▉▇▉╭◢▉▇▇▉▉▇▇▉▇▇
▇▉▉▇◣▔▔̴▔▔▔▔̴▔◥▇▉▇
▉▉▇▉▉▇▇▉▇▇▉◣╮◥▇▇
▉▇◤▔▔̴▔▔▔▔▔̴▔▔╯◢▉▇
▇◤╭◢▇▇▉▇▇▉▇▉▇▇▇▉
▇▇▇▇▇◤▔▔▔▔◥▇▇▇▇▇
▇▇▇▇◤╱╲┊┊╱╲◥▇▇▇▇
▇▇▇◤▕╭╮▏▕╭╮▏◥▇▇▇
▇▇◤╱▕┗┛▏▕┗┛▏╲◥▇▇
▇◤▂▂▂▂̅▂̅▂▂▂̅▂̅▂▂▂◥▇
▇▇┏┓┏┓┏┓┏┓┏┓┏┓▇▇
▇▇┗┛┗┛┃̊┃┗┛┗┛┗┛▇▇
"""


print(home)


# Запрашиваем длину стороны квадрата у пользователя
s = int(input("Введите длину стороны квадрата: "))

area = s ** 2

print("Площадь квадрата:", area)

#Вывод следующего числа
num = int(input("Введите число: "))
print("Следующее число:", num + 1)

num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
sum = num1 + num2
print(f"Сумма чисел {sum}")

# Произведение
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
sum = num1 * num2
print(f"Сумма чисел {sum}")

num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
num3 = int(input("Третье число: "))
sum1 = num1 + num2
sum2 = num2 - num3
sum3 = num1 * num3

print(f"{num1} + {num2} = {sum1}")
print(f"{num2} - {num3} = {sum2}")
print(f"{num1} * {num3} = {sum3}")

# ом
simvol1 = "о"
simvol2 = "м"
colvo = int(input("Введите число: "))

result1 = simvol1 * colvo
result2 = simvol2 * colvo

# Объединяем строки в одну
result = result1 + result2
print(result)

total_count = len(result)
print("Общее количество символов:", total_count)

